; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-4-2-2-6-6-3) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 distributor0)
	(clear crate0)
	(at pallet5 distributor1)
	(clear crate2)
	(at truck0 depot2)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 distributor0)
	(available hoist4)
	(at hoist5 distributor1)
	(available hoist5)
	(at crate0 distributor0)
	(on crate0 pallet4)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 distributor1)
	(on crate2 pallet5)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 crate2)
		(on crate2 pallet1)
	)
))

; plan
1. (lift hoist5 crate2 pallet5 distributor1)
   deleted: (at crate2 distributor1) (available hoist5) (on crate2 pallet5) (clear crate2)
   added: (lifting hoist5 crate2) (clear pallet5)
   goals met: 0 of 3
2. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 0 of 3
3. (load hoist5 crate2 truck0 distributor1)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 0 of 3
4. (lift hoist4 crate0 pallet4 distributor0)
   deleted: (at crate0 distributor0) (available hoist4) (on crate0 pallet4) (clear crate0)
   added: (lifting hoist4 crate0) (clear pallet4)
   goals met: 0 of 3
5. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 0 of 3
6. (load hoist4 crate0 truck0 distributor0)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck0) (available hoist4)
   goals met: 0 of 3
7. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 0 of 3
8. (unload hoist2 crate0 truck0 depot2)
   deleted: (available hoist2) (in crate0 truck0)
   added: (lifting hoist2 crate0)
   goals met: 0 of 3
9. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   goals met: 0 of 3
10. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (at crate0 depot2) (available hoist2) (on crate0 pallet2) (clear crate0)
   goals met: 1 of 3
11. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (available hoist1) (on crate1 pallet1) (clear crate1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 1 of 3
12. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 1 of 3
13. (unload hoist1 crate2 truck0 depot1)
   deleted: (available hoist1) (in crate2 truck0)
   added: (lifting hoist1 crate2)
   goals met: 1 of 3
14. (drop hoist1 crate2 pallet1 depot1)
   deleted: (lifting hoist1 crate2) (clear pallet1)
   added: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   goals met: 2 of 3
15. (unload hoist1 crate1 truck0 depot1)
   deleted: (available hoist1) (in crate1 truck0)
   added: (lifting hoist1 crate1)
   goals met: 2 of 3
16. (drop hoist1 crate1 crate2 depot1)
   deleted: (lifting hoist1 crate1) (clear crate2)
   added: (at crate1 depot1) (available hoist1) (on crate1 crate2) (clear crate1)
   goals met: 3 of 3
